
ABOUT_MESSAGE = """
Мы сервис <b>Intelligent Store</b>, занимающийся продажей и выкупом оригинальной одежды и электроники из-за границы.

<b>1.</b> Заказываем вещи с разных платформ, которые недоступны в России. 
<b>2.</b> По дополнительному запросу клиента, занимаемся поиском вещей по самой низкой цене. 
<b>3.</b> Проверяем брендовые вещи на их подлинность.    
<b>4.</b> Пополняем AliPay.

Имеем более 100 успешных сделок и 70+ отзывов от наших покупателей.

<b>Наши ссылки:</b>
<a href='https://vk.com/intellegentnost'><b>VK СТРАНИЦА</b></a>
<a href='https://vk.com/intelligentstore'><b>VK ГРУППА</b></a>
<a href='https://vk.com/wall673463594_38'><b>ОТЗЫВЫ</b></a>
<a href='https://t.me/intelligentchat'><b>ЧАТ ПО ПРОДАЖАМ</b></a>
<a href='https://t.me/intelligentnost'><b>TG КАНАЛ</b></a>
"""
